203_sloshingTank/001_sloshingTank_interFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      1;//2;
        nAlphaSubCycles 3;
        cAlpha          1;

        MULESCorr       yes;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    p_rgh
    {
        // solver          PCG;
        // preconditioner  DIC;
        // tolerance       1e-07;
        // relTol          0.05;
	solver    GAMG;
	tolerance    1e-8;
	relTol    0.01;
	minIter    1;
	smoother    DICGaussSeidel;
	nPreSweeps    0;
	nPostSweeps    2;
	cacheAgglomeration    on;
	agglomerator    faceAreaPair;
	nCellsInCoarsestLevel    200;
	mergeLevels    1;
	nFinestSweeps    2;
	nVcycles    2;
    }

    p_rghFinal
    {
	$p_rgh    ;
	tolerance    1e-6;
	relTol    0.0;
    }

    "pcorr.*"
    {
        // solver          PCG;
        // preconditioner  DIC;
        // tolerance       1e-5;
        // relTol          0;
	$p_rgh;
	tolerance    1e-2;
	relTol    0.0;
    }
    
    "(U|k|epsilon|omega).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
        minIter         1;
    }
}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefPoint       (0 0.500 0.031);    
	pRefValue    0;
	residualControl
	{
		U
		{
			tolerance    1e-4;
			relTol    0;
		}

		p_rgh
		{
			tolerance    5e-4;
			relTol    0;
		}
	}
}

relaxationFactors
{
    equations
    {
        ".*"                1;
    }
}


// ************************************************************************* //
